[
  {
    "title": "Coochie Culture",
    "image": "/images/Cover/Coochie Culture.png",
    "content": "Coochie Culture is designed specifically for young people, aiming to make sex education engaging, relatable, and up-to-date.<br><br>We break down essential topics about the female body, sexual health, and relationships in a way that feels approachable and fun, removing the stigma and awkwardness often associated with these discussions.<br><br>By using current language, trends, and humor, we ensure that young people can connect with the content, feel empowered with accurate information, and gain confidence in understanding their bodies.<br><br>Our goal is to foster a culture of openness, knowledge, and respect for bodily autonomy.<br><br>Our written guides on menstruation and adolescence provide easy-to-understand information, helping girls navigate this natural process with confidence and knowledge.<br><br>By making these topics accessible, we aim to break down taboos and promote a healthy understanding of female health from a young age."
  },
  {
    "title": "Dedicated Doula Care Services",
    "image": "/images/Cover/Doula Care.png",
    "content": "Our NGO offers dedicated doula care services, led by a South African doula trained under WOMBS (Women Offering Mothers Birth Support).<br><br>With hands-on experience in public hospitals, our doula provides compassionate, continuous support to mothers during pregnancy, labor, and postpartum.<br><br>We focus on educating and empowering women through physical, emotional, and informational support, ensuring a more positive and informed birthing experience for every mother."
  },
  {
    "title": "Imbali Empowerment",
    "image": "/images/Cover/Female Anatomy.png",
    "content": "Imbali Empowerment is dedicated to educating women and girls about their bodies through clear and engaging illustrations of female anatomy.<br><br>We believe that understanding the body is the first step towards self-confidence and empowerment.<br><br>Our written guide on menstruation provides easy-to-understand information, helping girls navigate this natural process with confidence and knowledge.<br><br>By making these topics accessible, we aim to break down taboos and promote a healthy understanding of female health from a young age."
  },
  {
    "title": "Gynaecology",
    "image": "/images/Cover/Gynaecology.png",
    "content": "The female body is truly extraordinary—its hormones and organs work in perfect harmony to sustain health and life.<br><br>However, when this delicate balance is disrupted, it can lead to a range of symptoms, from period pain and hormonal imbalances to more serious conditions like depression and cancer.<br><br>That’s why we’ve created a collection of professional, easy-to-understand guides tailored to address the unique challenges and conditions specific to the female body.<br><br>Empower yourself with knowledge and take charge of your health."
  },
  {
    "title": "STI Awareness",
    "image": "/images/Cover/STI.png",
    "content": "Important information about STI prevention and care..."
  },
  {
    "title": "Sisterhood Foundation",
    "image": "/images/Cover/Sisterhood Foundation.png",
    "content": "Help a Sister in Need<br><br>Help a sister in need by donating a lifesaving procedure or treatment she cannot afford.<br><br>You can choose to support a specific case or make a general donation, and we’ll ensure the funds are used where they are needed most.<br><br>Together, we can lift each other up, create hope, and change lives."
  },
  {
    "title": "Pregnancy",
    "image": "/images/Cover/Pregnancy.png",
    "content": "Pregnancy is a Very Special Time<br><br>Pregnancy is a very special time in a woman's life. It should be a journey of strength, love, and transformation.<br><br>But it can also be scary and challenging and painful. No matter what, your body is doing something truly extraordinary.<br><br>We’re here to support you every step of the way, answering your questions with care, professionalism, and absolutely no judgment."
  }
]
